package com.study.day15_list;

/*
 *
 * 1、什么是数据结构：
	数据结构是计算机存储和组织数据的方式。
	数据结构是指相互之间存在一种或多种特定关系的数据元素的集合。
	通常情况下，精心选择的数据结构可以带来更高的运行或者存储效率，数据结构往往同高效的
	检索算法和索引技术有关。
	
	常见的数据结构：
		Java中集合框架其实就是数据结构的实现的封装
		不同的数据结构的操作性能是不同的，有的查询性能很快，有的插入速度很快，有的是插入头和尾的速度很快，有的做等值判断很快，有的做范围查找很快；
		有的允许元素重复，有的不允许重复等等，在开发中，要根据具体的需求来选择。
		最简单的数据结构就是数组。
		
	2、数据结构的作用：
		1、模拟生活中数据的存储；
		2、作为程序员开发的工具。
	栈：先进后出
	队列：先进先出	
	数组：存储同一种类型的多个元素的容器，有索引，方便我们获取，数组查询快，增删慢（因为数组是定长的，增删都需要产生新数组）
	链表：有一个链子把多个结点连起组成的数据
		结点：由数据和地址组成
 *
 */
public class DataStructureDemo {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
